{
  "product": {
    "name": "Range Kleen 10124XN Style A 4-Pack Drip Pans, Chrome",
    "brand": "Range",
    "price": "19.99",
    "rating": "4.5",
    "reviews_count": "1271",
    "description": "Product Description Style “A” Chrome Universal Drip Pans Package includes 2 x 6-inch pan and 2 x 8-inch pan. At a small cost, you can definitely benefit a lot from our new 4-Pack Chrome Drip Pans. Save your time and effort from cleaning up stove dirt and oil splatter while saving energy cost in your household. From the Manufacturer: Style A Fits most PLUG-IN electric ranges including Admiral, Amana, Athens, Avanti, Bosch, Brown, Caloric, Chambers, Columbus Stove, Crosley, Dwyer, Electrolux, Enterprise, Estate, Frigidaire, Gaffers & Sattler, Galaxy, Gibson, Goodman (Caloric), Hardwick, Inglis, Jenn Air, Kelvinator, Kenmore (prior to 1995 & since 2004), KitchenAid, Magic Chef, Maytag, Modern Maid, Monarch, Montgomery Ward, Norge, Nutone, O’Keefe & Merritt, Peerless Premier, Perfection, Preway, Roper, Sunray, Tappan, Thermador, Waste King, Welbilt, Whirlpool, and White-Westinghouse From the Manufacturer Style A Chrome 4 Pack Universal Drip Pans 2 to 6-Inch and 2 to 8-Inch",
    "bullet_points": "• 1-YEAR LIMITED HOUSEHOLD WARRANTY: These drip pans have been designed to last up to 1 year of heavy duty use, just enough time to buy some new ones.\n• SAVE MONEY WHILE SHOWING LOVE FOR MOTHER EARTH: By replacing your drip pans annually, you can save your pocket up to $30 per year and leave less carbon footprint. Talk about hitting two birds with one stone!\n• GREAT KITCHEN ACCESSORY: Aside from keeping your stove looking new and fresh, this kitchen add-on has been shaped to fit perfectly into the stove, preventing cookware from rocking.\n• NO. 1 CONSUMER’S CHOICE: What more could someone ask for than affordable and sturdy drip pans that are easy to clean? This product is made with OEM (Original Equipment Manufacturer) quality and has passed the industry appliance standards testing.\n• AN EXCELLENT MULTI-PIECE ADDITION: Contains 2 small (6 inches) and 2 large (8 inches) Style A Chrome Drip Bowls to catch spillage while cooking.",
    "features": [
      "1-YEAR LIMITED HOUSEHOLD WARRANTY: These drip pans have been designed to last up to 1 year of heavy duty use, just enough time to buy some new ones.",
      "SAVE MONEY WHILE SHOWING LOVE FOR MOTHER EARTH: By replacing your drip pans annually, you can save your pocket up to $30 per year and leave less carbon footprint. Talk about hitting two birds with one stone!",
      "GREAT KITCHEN ACCESSORY: Aside from keeping your stove looking new and fresh, this kitchen add-on has been shaped to fit perfectly into the stove, preventing cookware from rocking.",
      "NO. 1 CONSUMER’S CHOICE: What more could someone ask for than affordable and sturdy drip pans that are easy to clean? This product is made with OEM (Original Equipment Manufacturer) quality and has passed the industry appliance standards testing.",
      "AN EXCELLENT MULTI-PIECE ADDITION: Contains 2 small (6 inches) and 2 large (8 inches) Style A Chrome Drip Bowls to catch spillage while cooking."
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71T4ePYk8oL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71syV3ObtUL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61yliK+1wyL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71Wx6dTJDoL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/919v345FtaL._AC_SL1500_.jpg"
    ],
    "specifications": {
      "name": "Warranty Description",
      "value": "Guaranteed for one year from date of purchase with copy of receipt Range Kleen will replace if damaged/rusting has been caused with normal use. Range Kleen reserves the right to use discretion on decisions of damage."
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B000I5SFSG",
    "scraped_at": "2025-07-18 11:32:43"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}