{
  "product": {
    "name": "Shur Line Paint Edger Replacement Pads",
    "brand": "SHUR-LINE",
    "price": "6",
    "rating": "4.3",
    "reviews_count": "2341",
    "description": "Product Description Chances are, you’ve been painting if you’re a homeowner or DIYer. If you’ve been painting a lot, chances are you’ve been using Shur-Line products, and that means you’ve been going through refill packs like nobody’s business! These unidirectional fiber pad packs can soak up any paint or stain you would need to complete any do-it-yourself painting project around the house. If you’re using these Shur-Line Edger or Edger Pro, you can rest assured that you will not be spending any more time or countless hours on wasteful painter’s tape! From the Manufacturer For more than 70 years, Shur-Line has offered innovative paint applicators and paint-related products. The brand aims to embolden, motivate and inspire do-it-yourself decorators to tackle projects, regardless of size – and have fun, save money and engage with the spaces in their home.",
    "bullet_points": "• COMPATIBLE WITH SHUR-LINE PAINTING PRODUCTS like the corner painter and the edger or edger pro Improved fibers makes quick work of do-it-yourself painting jobs with less dripping than traditional bucket and brushes and with virtually no lint\n• UNIDIRECTIONAL FIBERS makes quick work of do-it-yourself painting jobs with less dripping than traditional bucket and brushes and with virtually no lint\n• NO NEED TO TAPE any of your trimming projects with the help of these pads in tandem with the edger or corner painter (sold separately)\n• VERSATILE: This pad is able to soak up most paints and stains\n• IDEAL FOR UNEVEN SURFACES, so you can work in any room in the house, from the bathroom to the basement",
    "features": [
      "COMPATIBLE WITH SHUR-LINE PAINTING PRODUCTS like the corner painter and the edger or edger pro Improved fibers makes quick work of do-it-yourself painting jobs with less dripping than traditional bucket and brushes and with virtually no lint",
      "UNIDIRECTIONAL FIBERS makes quick work of do-it-yourself painting jobs with less dripping than traditional bucket and brushes and with virtually no lint",
      "NO NEED TO TAPE any of your trimming projects with the help of these pads in tandem with the edger or corner painter (sold separately)",
      "VERSATILE: This pad is able to soak up most paints and stains",
      "IDEAL FOR UNEVEN SURFACES, so you can work in any room in the house, from the bathroom to the basement"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/51QaCYcDV4L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61GsrpUcrRL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Ex50pjSAL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71m8Ej5ByJL._AC_SL1500_.jpg"
    ],
    "specifications": {
      "name": "Warranty Description",
      "value": "Limited lifetime guarantee"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B00002N8ZP",
    "scraped_at": "2025-07-18 11:27:54"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}