{
  "product": {
    "name": "Kichler Langford 35\" 4 Light Vanity Light with Satin Etched White Glass in Brushed Nickel",
    "brand": "Kichler",
    "price": "54.67",
    "rating": "4",
    "reviews_count": "1",
    "description": "Product Description The Langford 35\" 4 light vanity light features a classic look with its gentle curves in Brushed Nickel finish and satin etched white bell shaped glass. The Langford vanity light is perfect in several aesthetic environments, including transitional and traditional. From the Manufacturer Light Bulb:(4)100w G25 Med F Incand, Finish: Brushed Nickel With clean, flowing lines that embrace simple and graceful contemporary style, the Langford Collection is perfect for the homeowner looking for a new interpretation of classic design. The Brushed Nickel finish accentuates the Langford design with crisp appeal, allowing it to work with almost any decor. Langford fixtures provide a fresh ambiance to a room with the assistance of Etched white glass, providing an earthy comfort that blends well with more traditional interiors.",
    "bullet_points": "• Dazzle visitors with this updated traditional design in Olde Bronze, which gives off a tall and majestic vibe. Fits well with many exterior styles, including traditional and transitional.\n• Perfect for an entryway, patio, porch, or on either side of a garage door. Extend a coordinated look throughout your outdoors with this collection's other fixtures as well, including a pendant, ceiling light, and post lantern.\n• Provides ambient lighting to the entire room.\n• What's in the Box: (1) Mounting Strap, Strap Mounting Screws, Hex Nuts, Nipple, Wire Nuts and (4) Glass Shades. Bulb(s) not included.\n• Cleaning instructions: Be certain the electric current is turned off before cleaning. Clean metal components with a soft cloth moistened with a mild liquid soap solution. Wipe clean and buff with a very soft dry cloth.\n• Takes four medium E26 up to 100W bulb equivalent",
    "features": [
      "Dazzle visitors with this updated traditional design in Olde Bronze, which gives off a tall and majestic vibe. Fits well with many exterior styles, including traditional and transitional.",
      "Perfect for an entryway, patio, porch, or on either side of a garage door. Extend a coordinated look throughout your outdoors with this collection's other fixtures as well, including a pendant, ceiling light, and post lantern.",
      "Provides ambient lighting to the entire room.",
      "What's in the Box: (1) Mounting Strap, Strap Mounting Screws, Hex Nuts, Nipple, Wire Nuts and (4) Glass Shades. Bulb(s) not included.",
      "Cleaning instructions: Be certain the electric current is turned off before cleaning. Clean metal components with a soft cloth moistened with a mild liquid soap solution. Wipe clean and buff with a very soft dry cloth.",
      "Takes four medium E26 up to 100W bulb equivalent"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/31qt6wQiBbL._AC_SL1000_.jpg"
    ],
    "specifications": {
      "name": "Warranty Description",
      "value": "Warranty and limitations aside from the exceptions noted below, seller warrants the products it provides will be free from defects in material and workmanship for 1 (one) year following the date of shipment from seller. The exceptions are: landscape product (except as noted below and clarified in the landscape catalogs) for five years; black and/or \"textured architectural bronze\" finish transformers for 10 years; stainless steel transformers and the exterior finish on lifebrite outdoor lanterns for normal use for as long as the original purchaser owns the product; design pro series led cabinet light models # 12301brz, 12301ni, 12301wh, 12303brz, 12303ni, 12303wh, 12305brz, 12305ni, and 12305wh for normal use for as long as the original purchaser owns the product. Normal use means residential non-commercial use for no more than 6 hours per day in an environment that does not exceed 25 degrees celsius (approximately 77 degrees fahrenheit). Ceiling fan motors for as long as the original purchaser owns the product. A certain amount of \"wobble\" is normal in fans and should not be considered a problem. Energy star products for two years; and there are no warranties on light bulbs or the finish on outdoor polished brass products. If any of the warranted products are found by seller to be defective, such products will, at seller's sole option and cost, be replaced, repaired or refunded less an amount directly attributable to consumer's prior use of the product. The parties hereto expressly agree that buyer's sole and exclusive remedy against the seller shall be for the repair, replacement, or refund of defective products as provided herein. This warranty is not transferable whether to heirs, subsequent owners, or otherwise. This warranty does not cover labor or other costs or expenses to remove or install any defective, repaired or replaced product."
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B003KEBK3Y",
    "scraped_at": "2025-07-18 11:30:15"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}