{
  "product": {
    "name": "Segal S 4752 Fixed Window Guard – Adjustable Child Safety Window Guard Prevents Accidental Falls, Tamper Resistant Screws Included, Non-Egress, White, 23-1/2 to 38 In. W x 15-1/4 In. H (Single Pack)",
    "brand": "Defender Security",
    "price": "35.92",
    "rating": "4.4",
    "reviews_count": "957",
    "description": "Product Description Constructed of 0.048 inch thick white carbon steel square tubing, this Segal S 4752 Fixed Window Guard assists in preventing children from accidental falls through open windows. It’s a non-egress fixed window guard that cannot be opened or quickly removed in case of an emergency. It is not for use in bedrooms or sleeping quarters where no other emergency exit is accessible. For windows requiring emergency access capabilities, please use appropriate hinged version of these window guards, like Prime-Line’s model number S 4776. This non-operational child-fall window guard is designed to interior use only. It features a full adjustable telescoping width (prior to mounting) from 23-1/2 inch to 38 inch wide with a 15-1/4 inch reach, and it comes complete with one-way, tamper-proof installation screws. This child fall window guard meets New York City and New Jersey’s housing codes, and it was approved by the New York City Department of Health and Mental Hygiene, HDWG #04-09-2010, but it does not meet egress. From the Manufacturer This window guard is constructed of .048 thick, plain carbon steel square tubing and comes in a white painted finish. Note: This is a “fixed window guard,” meaning that once it’s been installed it cannot be opened nor easily removed in the event of an emergency where entry or exit through the window would be required. For this reason, THIS FIXED WINDOW GUARD SHOULD NOT BE USED IN BEDROOMS OR SLEEPING QUARTERS WHERE NO OTHER EMERGENCY EXIT WINDOW OR DOOR IS ACCESSIBLE. For windows requiring emergency access capabilities, please use appropriate hinged version of these window guards, like Prime-Line’s model number S-4779. This child fall window guard is non-operational and it is designed for interior use only. The intended purpose of this guard is to assist in preventing children from accidental falls through open windows. This window guard features a fully adjustable telescoping width (prior to mounting), and it comes complete with one-way, tamper-proof installation screws. This child fall window guard meets New York City and New Jersey’s housing codes, and it was approved by the New York City Department of Health and Mental Hygiene, HDWG #04-09-2010, but it does not meet egress.",
    "bullet_points": "• SECURITY GRATE – Constructed of 0.048 inch thick, white carbon steel square tubing, this fixed window guard assists in preventing children from accidental falls through open windows; it features 3-7/8 inch bar spacing on center\n• NON-EGRESS WINDOW BARS – This non-egress fixed guard cannot be opened or quickly removed in case of emergency; for windows requiring emergency access capabilities, please use appropriate hinged version of these window guards\n• INSTALLATION – This window security bar features a fully adjustable telescoping width (prior to mounting) from 23-1/2 inch to 38 inch, and it comes complete with one-way, tamper-proof installation screws; designed for interior use only\n• MEETS BUILDING CODES – This window grille meets New York City and New Jersey’s housing codes, and it was approved by the New York City Department of Health and Mental Hygiene, HDWG #04-09-2012\n• NOTE – Please refer to the line art drawing for all dimensional information and compare with your needs before purchasing",
    "features": [
      "SECURITY GRATE – Constructed of 0.048 inch thick, white carbon steel square tubing, this fixed window guard assists in preventing children from accidental falls through open windows; it features 3-7/8 inch bar spacing on center",
      "NON-EGRESS WINDOW BARS – This non-egress fixed guard cannot be opened or quickly removed in case of emergency; for windows requiring emergency access capabilities, please use appropriate hinged version of these window guards",
      "INSTALLATION – This window security bar features a fully adjustable telescoping width (prior to mounting) from 23-1/2 inch to 38 inch, and it comes complete with one-way, tamper-proof installation screws; designed for interior use only",
      "MEETS BUILDING CODES – This window grille meets New York City and New Jersey’s housing codes, and it was approved by the New York City Department of Health and Mental Hygiene, HDWG #04-09-2012",
      "NOTE – Please refer to the line art drawing for all dimensional information and compare with your needs before purchasing"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/41dG8nEaNCL._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/511S8wjozfL._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/71YEm6DIBGL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71EBzF53DWL._AC_SL1464_.jpg",
      "https://m.media-amazon.com/images/I/71Wi5gtwNtL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71YQ9dar+tL._AC_SL1500_.jpg"
    ],
    "specifications": {
      "name": "Warranty Description",
      "value": "1 year limited."
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B00E7PSRUY",
    "scraped_at": "2025-07-18 11:29:52"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}