{
  "product": {
    "name": "VIGO Titanium 17\"L x 17\"W x 6\"H Over the Counter Glass Round Vessel Bathroom Sink in Slate Grey -VG07050",
    "brand": "VIGO",
    "price": "109.9",
    "rating": "4.5",
    "reviews_count": "705",
    "description": "Product Description This VIGO sink features a shimmering mixture of black and silver tones. Handcrafted with possible unique and slight color variations so no two sinks are identical. Each sink is a dynamic work of art that complements any style bathroom. With its scratch resistant glass and non-porous surface fading and discoloration is a thing of the past. Pair it with a sleek VIGO Vessel faucet or Matching Waterfall faucet to create the complete look. VIGO VG07000 pop-up drain assembly and mounting ring sold separately. From the Manufacturer VIGO is a leading luxury kitchen and bath products manufacturer where exceptional design meets durability. Headquartered in the USA - the VIGO brand seamlessly marries stylish plumbing solutions with structural dependability in a unique, refined aesthetic. Our engineers stay at the forefront of technology and design by providing you only the newest and most stylish products on the market in an array of finishes. Our experts know that only the best designs and highest quality materials can meet the way you live your life. When you choose to bring a VIGO product into your home, you are instantly creating a level of sophistication, confidence, and strength that only VIGO can deliver. Guaranteed to meet your needs and your style - the majority of our products include a limited lifetime warranty. With over 25 years combined experience in the industry, VIGO has immediately established its reputation by delivering sophisticated and affordable kitchen and bath products with exceptional quality and extraordinary innovation. Each and every product goes through rigorous tests and trials to ensure that only the utmost quality and performance is delivered to your home. Many of our products are certified and follow mandatory industry standards. We strive for perfection, and know that every kitchen and bath deserves the best. At VIGO, we strive to: 1. Design and deliver the most luxurious, dependable kitchen and bath products 2. Lead efforts in design and innovation across all relevant industry channels 3. Provide the best in customer service and product satisfaction When everything comes together - it's no wonder why VIGO is one of the fastest growing kitchen and bath product manufacturers in the world. Experience the beauty and performance of VIGO, and witness for yourself why we really are High Design for Every Home.",
    "bullet_points": "• VESSEL SINK: Our round 17-in. L x 17-in. W x 6-in. H glass vessel sink blends modern design with a smooth surface and comes in various colors to enhance your bathroom's style and match your decor.,\n• EASYSINK SETUP: The vessel sink offers straightforward installation that works with standard plumbing connections, making it an excellent choice for both professional and DIY bathroom updates.,\n• TEMPGUARD GLASS: The non-porous tempered glass repels scratches, stains, heat and fading while maintaining its appearance throughout years of everyday bathroom usage.,\n• COLOR OPTIONS: Choose from a stunning array of colors for our vessel sinks, including wooden, copper, sheer black, white frost, brown and gold fusion, light wood, silver, and many more. Each sink is hand-painted to create a unique hue, available exclusively for your bathroom decor.,\n• LUXURY REDEFINED: Tempered glass vessel bathroom sinks showcase sophisticated design through quality construction and crafted details, elevating bathrooms with refined colors while seamlessly pairing with Vigo faucets.,\n• COUNTERTOP-FIT: The glass vessel sink integrates with your countertop to enhance style and function, offering a modern space-saving design that creates a stylish look in your bathroom.,\n• DRAIN DESIGN: Features a 1.75-inch drain opening for a pop-up drain without overflow, ensuring efficient water drainage and a sleek look.,\n• EASY CLEANING: Smooth glass surface enhance ease of cleaning, ensuring hassle-free maintenance for a pristine bathroom.,\n• LIFETIME WARRANTY: VIGO extends a limited lifetime warranty to all its vessel sinks offering customers peace of mind and quality assurance.,",
    "features": [
      "VESSEL SINK: Our round 17-in. L x 17-in. W x 6-in. H glass vessel sink blends modern design with a smooth surface and comes in various colors to enhance your bathroom's style and match your decor.,",
      "EASYSINK SETUP: The vessel sink offers straightforward installation that works with standard plumbing connections, making it an excellent choice for both professional and DIY bathroom updates.,",
      "TEMPGUARD GLASS: The non-porous tempered glass repels scratches, stains, heat and fading while maintaining its appearance throughout years of everyday bathroom usage.,",
      "COLOR OPTIONS: Choose from a stunning array of colors for our vessel sinks, including wooden, copper, sheer black, white frost, brown and gold fusion, light wood, silver, and many more. Each sink is hand-painted to create a unique hue, available exclusively for your bathroom decor.,",
      "LUXURY REDEFINED: Tempered glass vessel bathroom sinks showcase sophisticated design through quality construction and crafted details, elevating bathrooms with refined colors while seamlessly pairing with Vigo faucets.,",
      "COUNTERTOP-FIT: The glass vessel sink integrates with your countertop to enhance style and function, offering a modern space-saving design that creates a stylish look in your bathroom.,",
      "DRAIN DESIGN: Features a 1.75-inch drain opening for a pop-up drain without overflow, ensuring efficient water drainage and a sleek look.,",
      "EASY CLEANING: Smooth glass surface enhance ease of cleaning, ensuring hassle-free maintenance for a pristine bathroom.,",
      "LIFETIME WARRANTY: VIGO extends a limited lifetime warranty to all its vessel sinks offering customers peace of mind and quality assurance.,"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81FQiJ-E71L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91T6O1ngjlL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81sZBlTOp0L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81du8RWfrHL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81zJO4BSdLL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/812c3vzcwhL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/712lEmswQqL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71ZIUMeK1bL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/6162D-hbCfL._AC_SL1500_.jpg"
    ],
    "specifications": {
      "name": "Assembled Diameter",
      "value": "16.5 Inches"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B00O7R8ED2",
    "scraped_at": "2025-07-18 11:41:32"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}