{
  "product": {
    "name": "Ouidad Advanced Climate Control Heat & Humidity Gel",
    "brand": "Unknown",
    "price": "26",
    "rating": "4.5",
    "reviews_count": "4307",
    "description": "Our best-seller, Advanced Climate Control Heat & Humidity Gel, defines and helps protect your curls. The multitasker offers a soft hold with a crunch-free, lightweight finish that adds definition to lock in moisture and lock out humidity. Formulated with wheat protein and flexible styling polymers, your curls stay intact even as heat and humidity rise. Our signature high-performance Anti-Frizz Nano Technology with sericin, a protein derived from silk, forms an invisible barrier to block out humidity that causes frizz. “Nano” Technology refers to the size of the molecules in the formula, which are small enough to penetrate the cuticle and provide maximum frizz-fighting benefits. Safe for color-treated curls.\n*Certificate of Formula Compliance issued date: 26th June, 2018 and Authority of certification issued: LEC Associates LLC\nFounded in NYC by world-renowned stylist Ouidad in 1984, the original curl expert brand has perfected a unique customized approach for each curl type.\nOuidad's Advanced Climate Control Heat & Humidity Gel won Best Frizz Fighter in NaturallyCurly.com Editors' Choice Awards in 2017 and 2018.\nNo two curls are the same. Ouidad offers products for Loose, Classic, Tight, and Kinky curl types. Targeted and benefit-focused collections are designed for curls that need special care: Ultra-Hydration, Repair, Anti-Frizz, or Detox.\nAdvanced ingredients like silk-derived Anti-Frizz Nano Technology deliver results you can see and feel. Nourishing botanical extracts and natural oils create healthy, beautiful curls.",
    "bullet_points": "",
    "features": [],
    "images": [
      "https://m.media-amazon.com/images/I/61pv9Y2TH7L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/716ALgadCGL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/A1W6ZeLNK0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41FPfB5vo6L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/914I8-WogOL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71QbOM0h-SL._SL1500_.jpg"
    ],
    "specifications": {
      "upc": "843711263377 814591012355",
      "asin": "B077GMVCVG",
      "manufacturer": "Beauty By Imagination (Ouidad)",
      "best_sellers_rank": "#25 in Hair Styling Gels",
      "country_of_origin": "USA",
      "item_model_number": "93508",
      "product_dimensions": "2.5 x 2.5 x 6.5 inches; 8.5 ounces"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B077GMVCVG",
    "scraped_at": "2025-07-18 11:31:54"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 5
  }
}