{
  "product": {
    "name": "Commercial Electric (4-Pack) 4 in. Matte White Integrated LED Recessed Trim",
    "brand": "Commercial Electric",
    "price": "39.95",
    "rating": "4.4",
    "reviews_count": "59",
    "description": "The Commercial Electric 4 in. Color temperature select LED downlight is an easy way to upgrade your existing can lights to the sleek look of recessed lighting and LED energy efficient technology. These LED downlights are compatible with most dimmer switches and are equipped with a unique color temperature (CCT) changing technology. Now you can select your color temperature depending on your needs or preferences with the flip of a switch located on the back of the downlight. Test different color temperatures before installation and never be dissatisfied with CCT again. Color temperature of these LED downlights ranges from Warm White (2700K) to Daylight (5000K), with three options in between: Soft White (3000K), Neutral White (3500K) and Bright White (4000K). Using only 8.5-Watts of energy, but producing light similar to a 65-Watt incandescent, these LED downlight bulbs are estimated to cost only $1.36 per year to operate. Additionally, these LED downlights are rated to last for 50,000 hours or approximately 34 years. That is 50 times longer than a traditional incandescent BR30 lightbulb, which these downlights are used most commonly to replace. Compatible with most 4 in. recessed housings and equipped with a medium (E26) socket base adapter for easy installation. ENERGY STAR rated Brightness: 650 lumens Compatible with 5 and 6 in. cans Energy use: 8.5-Watt Rated for use in wet locations Instant on 92 CRI Dimmable Shatter resistant Medium (E26) socket base adapter included UL classified Light appearance: 2700K - 5000K Color temperature selection Lifetime: 50000 hours Product Weight (lb.): 0.49956236 Lumens: 650 Light Bulb Type Included: Integrated LED Fixture finish family: White Actual Color Temperature (K) - Color Temperature: 5000K - Daylight Actual Color Temperature (K): 5000 Fixture Material: Iron",
    "bullet_points": "",
    "features": [],
    "images": [
      "https://m.media-amazon.com/images/I/815S+CS8xGL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/815S+CS8xGL._AC_SL1500_.jpg"
    ],
    "specifications": {
      "name": "Batteries Required?",
      "value": "No"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B07FYTW6N3",
    "scraped_at": "2025-07-18 11:31:22"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}