{
  "product": {
    "name": "Abstract Modern Picture Wall Art: Blue Artwork Painting on Canvas for Office Living Room (45'' x 30'', Multiple Sizes)",
    "brand": "Abstract",
    "price": "113.99",
    "rating": "4.4",
    "reviews_count": "112",
    "description": "This artful modern abstract canvas wall art showcases a contemporary abstract image in blue and gray hues that blend easily with a variety of home decor. A perfect blue abstract wall artwork for modern and contemporary arrangements. Modern Painting for Wall: Giclee artwork, printed on high quality archival grade canvas, exclusive canvas stretching technique hides corner folds and provides a taut canvas surface. Abstract Art Wall Painting: Please note that color difference does exist between images and actual product due to lighting in photography. Abstract art gold and blue, abstract art paintings on canvas, abstract art for office, art canvas abstract, art wall decor abstract, blue wall decor abstract, canvas abstract art blue, canvas paintings abstract, canvas pictures abstract, office abstract artwork, paintings for living room abstract, wall decor paintings abstract, abstract wall art for bathrooms, abstract wall art silver and blue, canvas abstract art wall decor, canvas paintings wall art abstract, canvas wall art with blue abstract, paintings of abstract for kitchen, abstract paintings for bedroom, blue abstract wall art of canvas, painting abstract art, wall art painting abstract, canvas artwork wall decor abstract, abstract wall pictures bedroom, canvas art blue abstract, textured abstract wall art canvas, canvas abstract pictures for wall, abstract art wall decor canvas, wall art abstract paintings, contemporary abstract canvas, wall panting abstract art, abstract art pictures for wall, abstract canvas wall decor, painting on canvas abstract.",
    "bullet_points": "• SIZE: This Abstract Painting Wall Art includes 1 panel, the panel size is 45’’Wx30’’H\n• Abstract Canvas Wall Art: Splash abstract art across your walls with this blue canvas wall art, showcasing thick, frantic brushstrokes in deep hues of navy blue, cream, turquoise , gold, and white ( Multiple sizes available )\n• Modern Canvas Painting: These artful abstract wall artworks look lovely side by side, you can also hang them up in different rooms to carry a cohesive aesthetic throughout your abode\n• Teal Abstract Canvas Artwork: Printed on premium quality canvas in high quality fade resistant ink, this abstract art canvas wall is gallery wrapped over wooden bars, modern abstract texture painting artwork art for wall is ready to hang right out of the box with wall mounting hardware included\n• PLEASE NOTE:Copyright licensed image with high resolution definition.Due to different brand of monitors, the actual canvas wall art colors maybe slightly different from the product image, if have any problem please contact us.",
    "features": [
      "SIZE: This Abstract Painting Wall Art includes 1 panel, the panel size is 45’’Wx30’’H",
      "Abstract Canvas Wall Art: Splash abstract art across your walls with this blue canvas wall art, showcasing thick, frantic brushstrokes in deep hues of navy blue, cream, turquoise , gold, and white ( Multiple sizes available )",
      "Modern Canvas Painting: These artful abstract wall artworks look lovely side by side, you can also hang them up in different rooms to carry a cohesive aesthetic throughout your abode",
      "Teal Abstract Canvas Artwork: Printed on premium quality canvas in high quality fade resistant ink, this abstract art canvas wall is gallery wrapped over wooden bars, modern abstract texture painting artwork art for wall is ready to hang right out of the box with wall mounting hardware included",
      "PLEASE NOTE:Copyright licensed image with high resolution definition.Due to different brand of monitors, the actual canvas wall art colors maybe slightly different from the product image, if have any problem please contact us."
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71eA0CIpkTL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81YFejLD8gL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81n38Is83lL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71f4khG6cOL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51iNhJ+2RjL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71I4bsGfknL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71keblNDgjL._AC_SL1500_.jpg"
    ],
    "specifications": {
      "asin": "B07Y87F6HY",
      "item_weight": "4.4 pounds",
      "manufacturer": "TAR TAR STUDIO",
      "customer_reviews": "4.4 4.4 out of 5 stars 112 ratings 4.4 out of 5 stars",
      "best_sellers_rank": "#750,151 in Home & Kitchen (See Top 100 in Home & Kitchen) #206 in Paintings",
      "country_of_origin": "China",
      "product_dimensions": "45 x 30 x 0.2 inches",
      "date_first_available": "September 23, 2019"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B07Y87F6HY",
    "scraped_at": "2025-07-18 11:27:19"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}