{
  "product": {
    "name": "2013-2019 Tape-On Rain Guards for Nissan Sentra Side Window Deflector Visors S SV SR Smoke Tinted Vent Shades 2014 2015 2016 2017 2018",
    "brand": "Optimal Co",
    "price": "52.99",
    "rating": "4.4",
    "reviews_count": "1534",
    "description": "The Original Optimal Co window visors are manufactured with the highest grade acrylic material. It is the most durable and light weight product on the market.  The sleek stick-on window visors are engineered by using state-of-the-art technology to reduce sun glares and deflect rain whilst keep the cabin ventilated. The 4-piece set comes with easy to install adhesive tape that can withstand in all types of conditions.\nWhen sunlight enters while the windows are down, the heat and UV rays can cause damage to the interior of your car. This includes fading upholstery and cracking dashboard material.\nBlack inted window visors help block these harmful rays, so they don't have an opportunity to do this damage.\nOptimal side window visors are installed by using automotive grade 3M adhesive tape.\nIt lets you peel-and-stick the visors in minutes. Straightforward installation, no drilling or tools required.\nInstalling side window visors will greatly increase your driving experience.  Not only it allows you to let the window down, it gives you a clear view of the windows.\nTired of the rain and snow getting into your car while you drive?\nInstalling side window visors will help solve that problem.  With fresh air coming in, it will help reduce condensation build up.",
    "bullet_points": "• ✅CUSTOM FIT - Compatible with Nissan Sentra 2013-2019 S SV SR. Please be advised that the visors are vehicle specific. Please check your vehicle's compatibility to ensure proper fitment.\n• ✅HOW DO THEY WORK? - Side window deflectors work on a simple principle of aerodynamics by altering the flow of air ventilation in your vehicle while keeping the glare and rain out. It allows your vehicle to be well ventilated and reduces the need for the use of air conditioning.\n• ✅HASSLE-FREE INSTALLATION - Package includes alcohol wipes and automotive grade adhesive pre-applied to the visors. It lets you peel-and-stick the visors in minutes. Straightforward installation, no drilling or tools required. Note: Please use the alcohol wipes provided to clean door frame before installation.\n• ✅DURABILITY AND PRECISION - Engineered with the highest precision and the toughest material in the market. All our visors are made with reinforced acrylic material with tinted surface to reduce UV and scratches. Created specifically for your vehicle's make and model to ensure sleek and streamlined appearance.\n• ✅IMPROVE DRIVING EXPERIENCE - Driving with your window down at higher speed or in rain can cause discomfort to the driver and the passengers. With our side window deflectors, it deflects the rain and noise away from your windows to make your driving more enjoyable. Our visors also help prevent internal condensation due to no air circulation, as well as reducing sun glare through side windows.",
    "features": [
      "✅CUSTOM FIT - Compatible with Nissan Sentra 2013-2019 S SV SR. Please be advised that the visors are vehicle specific. Please check your vehicle's compatibility to ensure proper fitment.",
      "✅HOW DO THEY WORK? - Side window deflectors work on a simple principle of aerodynamics by altering the flow of air ventilation in your vehicle while keeping the glare and rain out. It allows your vehicle to be well ventilated and reduces the need for the use of air conditioning.",
      "✅HASSLE-FREE INSTALLATION - Package includes alcohol wipes and automotive grade adhesive pre-applied to the visors. It lets you peel-and-stick the visors in minutes. Straightforward installation, no drilling or tools required. Note: Please use the alcohol wipes provided to clean door frame before installation.",
      "✅DURABILITY AND PRECISION - Engineered with the highest precision and the toughest material in the market. All our visors are made with reinforced acrylic material with tinted surface to reduce UV and scratches. Created specifically for your vehicle's make and model to ensure sleek and streamlined appearance.",
      "✅IMPROVE DRIVING EXPERIENCE - Driving with your window down at higher speed or in rain can cause discomfort to the driver and the passengers. With our side window deflectors, it deflects the rain and noise away from your windows to make your driving more enjoyable. Our visors also help prevent internal condensation due to no air circulation, as well as reducing sun glare through side windows."
    ],
    "images": [
      "https://m.media-amazon.com/images/I/61WkOD5Jj9L._AC_SL1300_.jpg",
      "https://m.media-amazon.com/images/I/71THuYMuzqL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81c7eJGXLfL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51E8-g1-iaL._AC_SL1080_.jpg",
      "https://m.media-amazon.com/images/I/5175+tZ10JL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61H6hNwmpNL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51FUVi4nUgL._AC_.jpg"
    ],
    "specifications": {
      "name": "Manufacturer Part Number",
      "value": "NISTVS13"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B08L6VMFXP",
    "scraped_at": "2025-07-18 11:35:09"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}