{
  "product": {
    "name": "POLESTAR Electric Trailer Jack, 5000lbs Electric Power A-Frame Tongue Jack with Waterproof Protective Cover & LED Light for Travel Trailer Camper, RV, 12V DC with Hard Wiring, 9\"-27\" Lift",
    "brand": "POLESTAR",
    "price": "181.47",
    "rating": "4.3",
    "reviews_count": "653",
    "description": "With over 20 years of professional experience, POLESTAR is committed to providing high-performance trailer and RV accessories that ensure a smooth and safe journey.\nis a powerful and economical choice with high durability and an attractive appearance. Advanced ball screw design, which ensures smooth, efficient lifting and lowering, It allows for effortless raising, lowering, and leveling of your RV or trailer.\nWhether you're on an uneven camping site, parking lot, or incline, this electric jack ensures smooth, stable lifting for secure vehicle positioning\nWhat is the maximum weight capacity this electric trailer jack can handle?\nThis electric trailer jack is designed to handle up to 5000 lbs, making it perfect for most trailers, RVs, boats, and off-road vehicles. It provides smooth, efficient lifting and stability for your hauling needs.\nCan I use this electric trailer jack on an uneven surface or incline?\nYes, the POLESTAR electric trailer jack is designed for use on uneven surfaces. With its stable base and powerful lifting mechanism, it ensures smooth and safe operation, even on inclines or unlevel ground.\nDoes the jack include a battery, or do I need to purchase one separately?\nThe electric trailer jack operates using 12V DC power, which is typically sourced from your vehicle’s battery. It does not come with a separate battery, so you will need to connect it to your trailer or vehicle’s 12V power supply.\nHow long does it take to lift or lower the trailer with this electric jack?\nThe POLESTAR electric trailer jack operates efficiently with quick lifting and lowering times. Typically, it takes only a few minutes to fully raise or lower the trailer, depending on the load.\nIs the electric trailer jack weatherproof? Can it be used in rainy or snowy conditions?\nYes, the POLESTAR electric trailer jack is weather-resistant and built to withstand harsh outdoor conditions, including rain, snow, and extreme temperatures. Its durable construction ensures reliable performance year-round.\n5000 lbs Power Jack Black\n5000 lbs Power Jack White\n5000 lbs Upgrade Jack\n3500 lbs Power Jack Black\n3500 lbs Power Jack White\n3500lbs Basics Power Jack\n4000lbs Basics Power Jack",
    "bullet_points": "• Heavy Duty Electric Trailer Jack - The POLESTAR 5000 lbs Electric Trailer Jack is built for powerful lifting power, designed to effortlessly handle trailers, RVs, boats, and off-road vehicles up to 5000 lbs, POLESTAR Electric Tongue Jack supports a static load of up to 5000 lbs and dynamic lifting power reaching 7500 lbs Whether you're stabilizing a heavy-duty trailer or performing demanding tasks, this jack provides exceptional strength and reliability, making it perfect for a wide range of hauling needs.\n• Advanced Ball Screw Design for Superior Efficiency - At the heart of the POLESTAR electric trailer jack is its advanced ball screw design, which ensures smooth, efficient lifting and lowering. This high-precision mechanism reduces friction and wear, offering quicker, smoother, and more precise operation compared to traditional jacks. The ball screw design enhances the jack's lifting speed and overall performance, making trailer stabilization easier and more efficient than ever.\n• Durable and Reliable - Crafted from durable, weather-resistant materials, the POLESTAR jack is built to endure the toughest outdoor environments. Its robust design ensures long-lasting performance, withstanding rain, snow, and sun exposure, so it remains a reliable companion for all your outdoor and heavy-duty tasks, it has a built-in circuit breaker that automatically trips and resets if the amperage is too high.\n• Convenient and Efficient - The ball screw design works seamlessly with a powerful brake motor to provide consistent and stable lifting power. This combination ensures smoother operation, reduces strain, and offers enhanced control, allowing you to effortlessly raise and lower your trailer with minimal effort and maximum stability. Whether you're on an uneven camping site, parking lot, or incline, this electric jack ensures smooth, stable lifting for secure vehicle positioning.\n• Versatile Lift Range - With a lift range from 9 inches (retracted) to 27 inches, Plus 4.5 inch Drop Leg, Up to 31.5 inches, the POLESTAR 5000 lbs electric trailer jack is versatile enough to handle a wide variety of trailer types and hauling tasks. Improved LEDs shine down onto your ball and coupler where light is needed the most.\n• Trusted POLESTAR Quality - POLESTAR is known for providing high-performance, innovative trailer accessories that stand the test of time. Designed for both professionals and DIYers, the POLESTAR electric trailer jack combines strength, durability, and precision, ensuring your lifting and stabilizing tasks are always done with ease and confidence.\n• 1 Year Warranty, Enhance Performance. Easy Installation. High Reliability, and our friendly customer service.",
    "features": [
      "Heavy Duty Electric Trailer Jack - The POLESTAR 5000 lbs Electric Trailer Jack is built for powerful lifting power, designed to effortlessly handle trailers, RVs, boats, and off-road vehicles up to 5000 lbs, POLESTAR Electric Tongue Jack supports a static load of up to 5000 lbs and dynamic lifting power reaching 7500 lbs Whether you're stabilizing a heavy-duty trailer or performing demanding tasks, this jack provides exceptional strength and reliability, making it perfect for a wide range of hauling needs.",
      "Advanced Ball Screw Design for Superior Efficiency - At the heart of the POLESTAR electric trailer jack is its advanced ball screw design, which ensures smooth, efficient lifting and lowering. This high-precision mechanism reduces friction and wear, offering quicker, smoother, and more precise operation compared to traditional jacks. The ball screw design enhances the jack's lifting speed and overall performance, making trailer stabilization easier and more efficient than ever.",
      "Durable and Reliable - Crafted from durable, weather-resistant materials, the POLESTAR jack is built to endure the toughest outdoor environments. Its robust design ensures long-lasting performance, withstanding rain, snow, and sun exposure, so it remains a reliable companion for all your outdoor and heavy-duty tasks, it has a built-in circuit breaker that automatically trips and resets if the amperage is too high.",
      "Convenient and Efficient - The ball screw design works seamlessly with a powerful brake motor to provide consistent and stable lifting power. This combination ensures smoother operation, reduces strain, and offers enhanced control, allowing you to effortlessly raise and lower your trailer with minimal effort and maximum stability. Whether you're on an uneven camping site, parking lot, or incline, this electric jack ensures smooth, stable lifting for secure vehicle positioning.",
      "Versatile Lift Range - With a lift range from 9 inches (retracted) to 27 inches, Plus 4.5 inch Drop Leg, Up to 31.5 inches, the POLESTAR 5000 lbs electric trailer jack is versatile enough to handle a wide variety of trailer types and hauling tasks. Improved LEDs shine down onto your ball and coupler where light is needed the most.",
      "Trusted POLESTAR Quality - POLESTAR is known for providing high-performance, innovative trailer accessories that stand the test of time. Designed for both professionals and DIYers, the POLESTAR electric trailer jack combines strength, durability, and precision, ensuring your lifting and stabilizing tasks are always done with ease and confidence.",
      "1 Year Warranty, Enhance Performance. Easy Installation. High Reliability, and our friendly customer service."
    ],
    "images": [
      "https://m.media-amazon.com/images/I/615JIQ+cQEL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81bezbNMqrL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91aJRf1GPjL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/814tH-cFq5L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/7190w2GCCWL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/813QcSXRL4L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71qn9EtaV1L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81aAzKYE-BL._AC_SL1500_.jpg"
    ],
    "specifications": {
      "name": "Manufacturer Part Number",
      "value": "10201091"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B09W5FS6ZD",
    "scraped_at": "2025-07-18 11:29:02"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}