{
  "product": {
    "name": "9 Inches Acrylic Wall Shelves 2 Pack, Floating Shelf for Wall Mounting, Acrylic Display Ledges for Funko Pop Figures, Home Décor, Living Room, Gaming Room, Plants(9 inch, Clear)",
    "brand": "Sezanrpt",
    "price": "14.99",
    "rating": "4.6",
    "reviews_count": "879",
    "description": "Specialized in Home Organizer to Save Space and Keep Room Tidy!\noffers a range of high quality acrylic home organizer, wall shelf, home storage shelf, home display stand and crystal acrylic picture frame.\nown a professional factory which are Specialized in acrylic storage and display products. Quality is the most important for Sezanrpt. So we execute strict quality control system in our own factory.\nWe offer 10 size acrylic wall shelf in three colors to help you save space in your house.\nWe offer 4 size acrylic wall shelf in three colors to help you save space in your house.\nSezanrpt corner shelf can help you to organize your countertop and save your space.\nAcrylic wall mounted spice rack, with two end caps on side. Protect your spice jars to fall off.\n24'' or 15''. You can choose the best size for your nail salon.\nSezanrpt also offer multi-size acrylic picture frame to help our customers to record their happy memories.\nThe acrylic wall shelf can be used in your living room for home decor, books and plants. 12 inch and 17 inch in clear and white color. Very suitable for your living room wall.\nSezanrpt wall shelf can be used in your bathroom and save your vanities space. You can organize your toiletries on the wall shelf. Choose your favorite color and the best size for your bathroom.\nThe wall shelf can be used in your bedroom to hold your picture frame, figure, books and any home decor. If you are lack of space, Sezanrpt can help you to get more space!\nSezanrpt wall shelf can be used in your kitchen to be a perfect wall organizer. You will need a organizer for your spice or other bottles. Try this wall shelf.\nIf you are running a shoes store, this acrylic wall shelf would be perfect for you. Sezanrpt's  12 inch wall shelf can be a perfect floating shoes display shelf in your store.\nIf you are running a brand store for bag, the acrylic wall shelf would be perfect for your store. Install them in the wall and display your bag or shoes.\nThe wall shelf with all round corner will keep you safe when you take out things or install it.\nWith 3 holes or 5 holes, the wall shelf can hold 20-40 Lbs. 6 inch depth. Very big capacity.\nThe material is 100% acrylic. Sturdy and durable in your home.\nWe offer all accessories for installation: level, screws, anchors, screwdriver, instruction. Very easy to install!\nWall Shelves\n12 inch length, 6 inch depth. 4MM thickness. We offer clear, black and white for your color choice.\nWall Shelves\n17 inch length, 6 inch depth. 4MM thickness. We offer clear, black and white for your color choice.\nWall Shelves\n24 inch length, 6 inch depth. 5MM thickness. We offer clear, black and white for your color choice.\nWall Shelves\n36 inch length, 6 inch depth. 5MM thickness. We offer clear, black and white for your color choice.\nWall Shelves\n36+24+12 inch length, 6 inch depth. We offer clear, black and white for your color choice.\nUse the level and marker pen to mark the position of holes.\nDrill the holes in the wall.\nHammer the anchors into the holes\nInstall the wall shelf in the wall by screwdriver\nInstallation finished\n6 Inch Width Wall Shelf\n4 Inch Width Wall Shelf\nCorner Shelf\nAcrylic Display Risers\n15 Inch Wall Shelf\nPicture Frame\nNail Polish Wall Rack\nWhat would be included in the package?\nSezanrpt offer full accessories for your installation: 2 wall shelves, screws+anchors, screwdriver, instruction, level, marker pen.\nWhat weight capacity can the wall shelf hold?\n6 inch can hold 5 Lbs; 9 inch can hold 5 Lbs; 12 inch can hold 10 Lbs; 17 inch can hold 15 Lbs; 24 inch can hold 20 Lbs; 36 inch can hold 30 Lbs; Big capacity.\nWhat material is the wall shelf made of?\nThe material of wall shelf is 100% acrylic in clear, black or white color. Sturdy, luxurious and moistureproof.\nCan I drill an additional hole on the shelf for cords? Will it break?\nYes, no problem. The acrylic material can be drilled many holes. It won't be breakable when drilling.\nCan I get a new one replacement or other service if I'm not satisfied with the order?\nYes, Sezanrpt can resend a new one or offer other service if any unsatisfication with our products.",
    "bullet_points": "• What You Will Get : Two pieces clear acrylic floating shelves, one marker, 4 sets screws and anchors, one cross screwdriver and one marker. W9'' x D6'' x H2.8'' in 4mm thickness which would be very stable and sturdy to ensure your safety when fixed into the wall.\n• Introduction of Small Wall Shelf : These wall shelves are made in high transparency 100% acrylic material and in 4mm thickness which is much thicker than others(3mm). The hot bending design make the wall mounting shelves heavy duty which can hold 5Lbs max. With diamond polish edge. You will get a bright and beautiful floating shelves. With round corner and edge scraping, the wall shelves will never hurt hands.\n• Functions : Multi- functions for the wall mounted shelves. It can be used as bathroom storage shelves. It can also be a wall mounted shelf for plants, speaker, radio, funko pop, stuffed animal, books, picture frame, clock, cosmetics, toiletries. It can be used for bedroom, living room, bathroom, gaming room, kitchen, office, brand store.\n• Very Easy to Install: Firstly, Prepare the acrylic wall shelf and marker. Positioning the shelf and make a mark. Secondly, drill the holes in the wall with a hand electronic drill according to the mark and hammer the anchor into the holes. Finally, fix the acrylic shelf on the wall by the screwdriver.\n• Sezanrpt Service: If any unsatisfication with our products, feel free to contact us. Sezanrpt will offer a good service to you. Sezanrpt also offer one year warranty period!",
    "features": [
      "What You Will Get : Two pieces clear acrylic floating shelves, one marker, 4 sets screws and anchors, one cross screwdriver and one marker. W9'' x D6'' x H2.8'' in 4mm thickness which would be very stable and sturdy to ensure your safety when fixed into the wall.",
      "Introduction of Small Wall Shelf : These wall shelves are made in high transparency 100% acrylic material and in 4mm thickness which is much thicker than others(3mm). The hot bending design make the wall mounting shelves heavy duty which can hold 5Lbs max. With diamond polish edge. You will get a bright and beautiful floating shelves. With round corner and edge scraping, the wall shelves will never hurt hands.",
      "Functions : Multi- functions for the wall mounted shelves. It can be used as bathroom storage shelves. It can also be a wall mounted shelf for plants, speaker, radio, funko pop, stuffed animal, books, picture frame, clock, cosmetics, toiletries. It can be used for bedroom, living room, bathroom, gaming room, kitchen, office, brand store.",
      "Very Easy to Install: Firstly, Prepare the acrylic wall shelf and marker. Positioning the shelf and make a mark. Secondly, drill the holes in the wall with a hand electronic drill according to the mark and hammer the anchor into the holes. Finally, fix the acrylic shelf on the wall by the screwdriver.",
      "Sezanrpt Service: If any unsatisfication with our products, feel free to contact us. Sezanrpt will offer a good service to you. Sezanrpt also offer one year warranty period!"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/61PgqbEA1BL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71aMURdFRiL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61OIZEXRvLL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71wvYpipvEL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81rXuX0ywbL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81vZsxmvYXL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71h5QIx11YL._AC_SL1500_.jpg"
    ],
    "specifications": {
      "upc": "726852218973",
      "asin": "B0C4GY1YCZ",
      "size": "9 Inch",
      "brand": "Sezanrpt",
      "style": "Modern",
      "room_type": "Kitchen, Bathroom, Bedroom, Living Room, Playroom",
      "finish_type": "Polished",
      "item_weight": "1 pounds",
      "manufacturer": "Sezanrpt",
      "product_name": "Small Acrylic Wall Shelf, Ledges, Small Floating Shelf",
      "weight_limit": "5 Pounds",
      "number_of_items": "2",
      "shelf_thickness": "4 Millimeters",
      "special_feature": "Space Saving, Moisture Resistant, Heavy Duty, Durable, Water Resistant",
      "weight_capacity": "Maximum weight: 5 Pounds",
      "customer_reviews": "4.6 4.6 out of 5 stars 879 ratings 4.6 out of 5 stars",
      "assembly_required": "No",
      "best_sellers_rank": "#15,391 in Home & Kitchen (See Top 100 in Home & Kitchen) #59 in Floating Shelves",
      "installation_type": "Wall Mount",
      "item_model_number": "726852218973",
      "number_of_shelves": "2",
      "product_dimensions": "6\"D x 9\"W x 2.8\"H",
      "included_components": "Screws + Anchors + Screwdriver, Wall Shelf 2 Pack, Marker Pen, Level, Instruction",
      "date_first_available": "May 6, 2023",
      "age_range_description": "Adult",
      "min_required_door_width": "10 Inches",
      "product_care_instructions": "Wipe with Damp Cloth",
      "specific_uses_for_product": "Toiletries, Decorative Items, Shoes, Kitchen Utensils, Plants",
      "recommended_uses_for_product": "Indoor"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B0C4GY1YCZ",
    "scraped_at": "2025-07-18 11:29:39"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}