{
  "product": {
    "name": "COMFY-HOMI 3-Pack Cotton Rope Woven Basket with Handles for Shelves, Books, Toys, Cloth Storage|Towel Storage|Nursery Baby Basket - 13.5\" x 11\" x 9.5\" for Living Room (White/Brown)",
    "brand": "COMFY-HOMI",
    "price": "33.99",
    "rating": "4.6",
    "reviews_count": "266",
    "description": "A comfortable home is the cornerstone of everything in life.\nThat is the value our product should deliver.\nHence, COMFY-HOMI was created.\nSTYLISH DESIGN: This elegantly basket is perfect for decoration of modem home.Consisthing of white and grey, the neutral color fits in any rooms.\nHandmade from high quality rope,it is safe to use and no harm to health.It create a good sense of nature in your beautiful home.\nShelf baskets can enhance the organization of your home, providing a simple and effective solution to keep items neatly stored and easily accessible.\nCrafted with care, a woven basket is a handwoven testament to artisanal skill, offering both beauty and functionality for organizing your space.\nA well-sized rope basket is ideal for organizing items with ease, providing a harmonious blend of form and function in your home.\nA storage basket, renowned for its durability and performance, offers a reliable storage solution that beautifully complements any home decor.\nBLANKET BASKET\nBLANKET BASKET\nLAUNDRY BASKET\n3PCS TOY STORAGE BIN\nSTORAGE BASKET\n3PCS STORAGE BIN\nLAUNDRY BASKET\nHow is the quality of your rope basket？\nOur rope basket is made from premium cotton ropes that are tightly woven together to create a sturdy and durable design. Unlike other brands, our rope baskets are handmade by skilled artisans who take great care in creating each piece.\nThe rope basket arrived folded. How can I restore it to its shape as your ad?\nFollow the instructions to get the right shape-stuffed it full of goods or pillows for a couple of days that will help you to get better shape. It's better to iron it with an iron.\nCan your cotton rope baskets be used as gift baskets?\nAbsolutely! Our cotton rope baskets make beautiful and unique woven storage baskets for any occasion. They are great for holding items like wine, chocolates, or gourmet snacks, and can be personalized with ribbons or tags for a special touch.",
    "bullet_points": "• UNIQUE ROPE BASKET: These are the COMFY-HOMI new rectangular baskets. Rectangular woven baskets are the great solution for your home decoration\n• MEDIUM BASKETS FOR ORGANIZING: 13.5''Lx11''Wx 9.5''H, Cotton rope baskets can be used in baby room, kid’s room, nursery, living room, bathroom, office. And are very ideal for storing books, toys, clothes,towels. It's a great way to store them out of sight\n• SOFT & STURDY MATERIAL: The soft basket won’t let you worry about leaving scratch marks or collision on furniture. And the medium basket can also be used as toy bin, baby basket, dog toy basket, storage bin, toy storage, blanket basket for Baby Shower\n• No Sharp Edges: no worry leaving scratch marks or collision dents on furniture. Handmade product is chemical-free, non-toxic, and eco-friendly. No harm to health.\n• CUTE STORAGE BASKET: Storage baskets are made by hand. They are chemical-free, non-toxic, and eco-friendly. No harm to health. And the soft material does not have to worry about hurting children\n• MEASURE SIZE: When measuring Storage Bin, from the basket's outside instead of inside. Due to the soft material and folding mode and handmade basket, in order to avoid measurement errors, please tidy the basket first before measuring\n• EASY SHAPING: The storage baskets are package folded which may form some shipping creases. Follow the instructions to get the right shape- stuffed it full of goods or pillows for a couple of days. For the quick shape, you can use iron",
    "features": [
      "UNIQUE ROPE BASKET: These are the COMFY-HOMI new rectangular baskets. Rectangular woven baskets are the great solution for your home decoration",
      "MEDIUM BASKETS FOR ORGANIZING: 13.5''Lx11''Wx 9.5''H, Cotton rope baskets can be used in baby room, kid’s room, nursery, living room, bathroom, office. And are very ideal for storing books, toys, clothes,towels. It's a great way to store them out of sight",
      "SOFT & STURDY MATERIAL: The soft basket won’t let you worry about leaving scratch marks or collision on furniture. And the medium basket can also be used as toy bin, baby basket, dog toy basket, storage bin, toy storage, blanket basket for Baby Shower",
      "No Sharp Edges: no worry leaving scratch marks or collision dents on furniture. Handmade product is chemical-free, non-toxic, and eco-friendly. No harm to health.",
      "CUTE STORAGE BASKET: Storage baskets are made by hand. They are chemical-free, non-toxic, and eco-friendly. No harm to health. And the soft material does not have to worry about hurting children",
      "MEASURE SIZE: When measuring Storage Bin, from the basket's outside instead of inside. Due to the soft material and folding mode and handmade basket, in order to avoid measurement errors, please tidy the basket first before measuring",
      "EASY SHAPING: The storage baskets are package folded which may form some shipping creases. Follow the instructions to get the right shape- stuffed it full of goods or pillows for a couple of days. For the quick shape, you can use iron"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81Dn9g8pbQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71AFqBDmrRL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71g+1eu+N5L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81wM0XHQFDL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81dJZ0PsJlL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81lJZRj1mnL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81iZCrT84XL._SL1500_.jpg"
    ],
    "specifications": {
      "name": "Country/Region of origin",
      "value": "China"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B0C9PLCHHP",
    "scraped_at": "2025-07-18 11:31:50"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}