{
  "product": {
    "name": "KPY Window Visor Compatible with Hyundai Accent Sedan 2012-2017, 4PC Rain Guard Side Window Vent Deflectors Tape-On Mugen Style, 2012 2013 2014 2015 2016 2017",
    "brand": "KPY",
    "price": "34.89",
    "rating": "3.9",
    "reviews_count": "2965",
    "description": "Revitalize your ride with KPY BizConnect. Explore our selection of premium auto parts, backed by years of industry expertise and a dedication to customer need. Drive with confidence, shop with ease.\nPassionate about automobiles, we founded KPY BizConnect with a mission to provide premium auto parts on Amazon. Our commitment to quality drives everything we do.\nOur products stand out for their exceptional quality and reliability. We meticulously source premium auto parts, ensuring they meet our stringent standards for performance, durability, and customer need.\nWe're driven by our passion for automobiles and the satisfaction of providing top-quality auto parts to our customers.\nEasy to install – no drilling or extra tools needed. Simply stick on with the included 3M automotive grade adhesive.\nFreshen up your cab effortlessly, keeping rain and weather out. Simply crack the window to eliminate stubborn odors and enjoy cleaner air inside.\nPrecision-engineered to match your vehicle's year, make, and model, boasting a distinctive design that enhances your ride's contours.\nCrafted from high-impact acrylic, our product is UV and scratch-resistant, ensuring optical transparency and durability.\nElevate your ride with KPY BizConnect’s premium window visors. Enjoy fresh air and comfort in any weather, thanks to our sleek, durable design. Perfect fit, easy installation—experience the difference with KPY BizConnect.",
    "bullet_points": "• 【Perfect Fit】KPY window visors rain guards vent deflectors compatible with Hyundai Accent Sedan 2012 2013 2014 2015 2016 2017 (Mugen Style)\n• 【Premium Quality】Crafted from robust and enduring materials, these items exhibit remarkable resistance to UV rays and scratches. Moreover, the inclusion of 3M Tape ensures a steadfast and secure attachment.\n• 【Optimal Performance】Say goodbye to concerns about rain or fog during your drive. Revel in the invigorating outdoor air by keeping your window slightly ajar, regardless of the weather conditions.\n• 【Simple Setup】Installation is a breeze and no drilling or special tools required. Prioritize a test fit for the visors before finalizing attachment. [NOTE: Refrain from washing your car within the initial 24 hours after installation.]\n• 【Guarantee & Assistance】We adhere strictly to Amazon's Return & Refund policy. Should you have any questions, feel free to reach out to us, and we will respond as quickly as possible.",
    "features": [
      "【Perfect Fit】KPY window visors rain guards vent deflectors compatible with Hyundai Accent Sedan 2012 2013 2014 2015 2016 2017 (Mugen Style)",
      "【Premium Quality】Crafted from robust and enduring materials, these items exhibit remarkable resistance to UV rays and scratches. Moreover, the inclusion of 3M Tape ensures a steadfast and secure attachment.",
      "【Optimal Performance】Say goodbye to concerns about rain or fog during your drive. Revel in the invigorating outdoor air by keeping your window slightly ajar, regardless of the weather conditions.",
      "【Simple Setup】Installation is a breeze and no drilling or special tools required. Prioritize a test fit for the visors before finalizing attachment. [NOTE: Refrain from washing your car within the initial 24 hours after installation.]",
      "【Guarantee & Assistance】We adhere strictly to Amazon's Return & Refund policy. Should you have any questions, feel free to reach out to us, and we will respond as quickly as possible."
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81qw5rG2D2L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71aylsn8rHL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Ol5G-LmcL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81jXgpMTvDL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81PWoIL7BrL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/815Pudvih5L._AC_SL1500_.jpg"
    ],
    "specifications": {
      "name": "Manufacturer Part Number",
      "value": "811512"
    },
    "availability": "",
    "url": "https://www.amazon.com/dp/B0D3XZFKGX",
    "scraped_at": "2025-07-18 11:36:20"
  },
  "metadata": {
    "extraction_successful": true,
    "error_message": null,
    "fields_extracted": 6
  }
}